Revit 2024 API
BuiltInFailures.MassFailures.NonOccupiableMassZone Property
 For mass zone, if the bottom level ref does not intersect, then this zone is going to be "not occupiable" and a warning is posted for it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NonOccupiableMassZone { get; }
Visual Basic
Public Shared ReadOnly Property NonOccupiableMassZone As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NonOccupiableMassZone {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace